
<!-- 
 هاد الملف يعتبر الاساس عشان اربط قاعدة البيانات يلي عملتها مع الموقع والاكواد يلي عندي 

* connفي الاول تم تعريف متغير عشان يعمل العلاقة وكان اسمه 
و هو يلي رح بتم تخزين الناتج من محاولة الاتصال مع قاعدة البيانات

* mysqli_connect هاد هي الدالة يلي رح يتم استخدامها عسان الاتصال

* localhost هاد عنوان السيرفر وهو هيك لانه الشغل على الجهاز الشخصي

* root هو اسم المستخدم وبيكون هاد الافتراضي لانه تم استعمال برنامجXAMPP

* '' هاد كلمة السر والاعدادات الافتراضية بتكون كلمة السر فاضية

* user_info هاد اسم قاعد البيانات

* mysqli_connect_error() هاد عشان تحكي وين صار الخطأ بالزبط
-->

<?php

$conn=mysqli_connect('localhost','root','','user_info');
if(!$conn){  // هان عشان لو الاتصال كان خطأ
    die("error".mysqli_connect_error()); // هان يعني وقف الشغل و الموقع ورح يطبع رسالة خطأ
}

?>
